app/controllers/bids_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "bids" ("email", "body", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "gaukhar@gmail.com"], ["body", "£100000000000"], ["listing_id", 1], ["created_at", "2015-09-23 20:46:19.599812"], ["updated_at", "2015-09-23 20:46:19.599812"]]
---
  def create
    listing = Listing.find(params[:bid][:listing_id])
    bid = listing.bids.create(bid_params)