app/controllers/home_controller.rb

SELECT "listings".* FROM "listings"  ORDER BY "listings"."created_at" DESC
---
  def index
    @listings = Listing.order(created_at: :desc)