app/controllers/listings_controller.rb

  def show
    @listing = Listing.find(params[:id])

    @bids = @listing.bids.order(created_at: :desc)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."listing_id" = ?  ORDER BY "bids"."created_at" DESC  [["listing_id", 1]]

  def create
    Listing.create(listing_params)
---
INSERT INTO "listings" ("email", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "gaukhar@gmail.com"], ["body", "Fly to the moon"], ["created_at", "2015-09-23 20:45:18.041204"], ["updated_at", "2015-09-23 20:45:18.041204"]]